auth/ci/performance-test.yaml
---
settings:
  env:
    CSV_TEST_USERS_DATA_PATH: ./postgres-data/test-users.csv
    JMETER_HOME: ~/apache-jmeter-5.6.2/bin
    RBP_AUTH_SERVICE_HOSTNAME: localhost
    RBP_AUTH_SERVICE_PORT: 3004

execution:
  - concurrency: 20
    iterations: 3
    ramp-up: 5s
    scenario: login-validate-logout

scenarios:
  login-validate-logout:
    script: performance-test-jmeter.jmx
    variables:
      CSV_TEST_USERS_DATA_PATH: ${CSV_TEST_USERS_DATA_PATH}
      RBP_AUTH_SERVICE_HOSTNAME: ${RBP_AUTH_SERVICE_HOSTNAME}
      RBP_AUTH_SERVICE_PORT: ${RBP_AUTH_SERVICE_PORT}

modules:
  jmeter:
    path: ${JMETER_HOME}/jmeter

reporting:
  - module: passfail
    criteria:
      - avg-rt of LoginPostEndpoint>=220ms for 5s, stop as failed
      - avg-rt of ValidatePostEndpoint>=120ms for 5s, stop as failed
      - avg-rt of LogoutPostEndpoint>=220ms for 5s, stop as failed
      - avg-rt >=280ms for 5s, stop as failed
      - fail >0 for 1s, stop as failed
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-xml: rbp-auth-performance-report.xml
  - module: junit-xml
    filename: rbp-auth-junit-performance-report.xml
    data-source: pass-fail