auth/ci/performance-test.yaml
---
execution:
  - concurrency: 20
    iterations: 3
    ramp-up: 5s
    scenario: login-validate-logout

scenarios:
  login-validate-logout:
    script: performance-test-jmeter.jmx

reporting:
  - module: passfail
    criteria:
      - avg-rt of POST /auth/login>=220ms for 5s, stop as failed
      - avg-rt of POST /auth/validate>=120ms for 5s, stop as failed
      - avg-rt of POST /auth/logout>=220ms for 5s, stop as failed
      - avg-rt of TOTAL>=280ms for 5s, stop as failed
      - failures of TOTAL>0% for 1s, stop as failed
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-xml: rbp-auth-performance-report.xml
  - module: junit-xml
    filename: rbp-auth-junit-performance-report.xml
    data-source: pass-fail